Balanceamento de carga/benchmark/cluster-server/#10 REQ-500 02122023 1120.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 60 --workers 9 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
9 workers

Running 60s test @ http://localhost:3000
500 connections
9 workers

|
┌─────────┬──────┬────────┬─────────┬─────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5% │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev      │ Max      │
├─────────┼──────┼────────┼─────────┼─────────┼───────────┼────────────┼──────────┤
│ Latency │ 5 ms │ 220 ms │ 4507 ms │ 5989 ms │ 969.56 ms │ 1382.41 ms │ 17614 ms │
└─────────┴──────┴────────┴─────────┴─────────┴───────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 353     │ 377     │ 558     │ 860    │ 585.34 │ 121.97  │ 353     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 50.7 kB │ 54.1 kB │ 80.1 kB │ 123 kB │ 84 kB  │ 17.5 kB │ 50.6 kB │
└───────────┴─────────┴─────────┴─────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 31621 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 465

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 5            │
├────────────┼──────────────┤
│ 2.5        │ 5            │
├────────────┼──────────────┤
│ 10         │ 5            │
├────────────┼──────────────┤
│ 25         │ 11           │
├────────────┼──────────────┤
│ 50         │ 220          │
├────────────┼──────────────┤
│ 75         │ 1415         │
├────────────┼──────────────┤
│ 90         │ 2593         │
├────────────┼──────────────┤
│ 97.5       │ 4507         │
├────────────┼──────────────┤
│ 99         │ 5989         │
├────────────┼──────────────┤
│ 99.9       │ 11229        │
├────────────┼──────────────┤
│ 99.99      │ 14973        │
├────────────┼──────────────┤
│ 99.999     │ 17614        │
└────────────┴──────────────┘

32k requests in 60.64s, 4.54 MB read
255 errors (162 timeouts)