Balanceamento de carga/benchmark/cluster-server/#11 REQ-25 02122023 1122.log
> cluster-api@1.0.0 test
> npx autocannon -c 25 -d 60 --workers 9 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
9 workers

Running 60s test @ http://localhost:3000
25 connections
9 workers

/
┌─────────┬──────┬───────┬───────┬────────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5% │ 99%    │ Avg      │ Stdev   │ Max    │
├─────────┼──────┼───────┼───────┼────────┼──────────┼─────────┼────────┤
│ Latency │ 6 ms │ 32 ms │ 95 ms │ 110 ms │ 36.25 ms │ 24.4 ms │ 379 ms │
└─────────┴──────┴───────┴───────┴────────┴──────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬───────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%   │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 423     │ 446     │ 487   │ 548     │ 491.32  │ 29.24  │ 423     │
├───────────┼─────────┼─────────┼───────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 60.7 kB │ 64.1 kB │ 70 kB │ 78.7 kB │ 70.6 kB │ 4.2 kB │ 60.7 kB │
└───────────┴─────────┴─────────┴───────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 29479 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 540

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 5            │
├────────────┼──────────────┤
│ 2.5        │ 6            │
├────────────┼──────────────┤
│ 10         │ 11           │
├────────────┼──────────────┤
│ 25         │ 17           │
├────────────┼──────────────┤
│ 50         │ 32           │
├────────────┼──────────────┤
│ 75         │ 50           │
├────────────┼──────────────┤
│ 90         │ 69           │
├────────────┼──────────────┤
│ 97.5       │ 95           │
├────────────┼──────────────┤
│ 99         │ 110          │
├────────────┼──────────────┤
│ 99.9       │ 150          │
├────────────┼──────────────┤
│ 99.99      │ 185          │
├────────────┼──────────────┤
│ 99.999     │ 379          │
└────────────┴──────────────┘

29k requests in 60.37s, 4.23 MB read