Balanceamento de carga/benchmark/cluster-server/#12 REQ-25 02122023 1124.log
> cluster-api@1.0.0 test
> npx autocannon -c 25 -d 2 --workers 10 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
10 workers

Running 2s test @ http://localhost:3000
25 connections
10 workers

\
┌─────────┬──────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼──────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 5 ms │ 31 ms │ 122 ms │ 136 ms │ 38.15 ms │ 33.43 ms │ 193 ms │
└─────────┴──────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬───────┬───────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg   │ Stdev │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────┼───────┼─────────┤
│ Req/Sec   │ 513     │ 513     │ 513     │ 516     │ 514.5 │ 1.5   │ 513     │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────┼───────┼─────────┤
│ Bytes/Sec │ 73.8 kB │ 73.8 kB │ 73.8 kB │ 74.2 kB │ 74 kB │ 224 B │ 73.7 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴───────┴───────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 1029  │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 20

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 5            │
├────────────┼──────────────┤
│ 2.5        │ 5            │
├────────────┼──────────────┤
│ 10         │ 5            │
├────────────┼──────────────┤
│ 25         │ 9            │
├────────────┼──────────────┤
│ 50         │ 31           │
├────────────┼──────────────┤
│ 75         │ 59           │
├────────────┼──────────────┤
│ 90         │ 83           │
├────────────┼──────────────┤
│ 97.5       │ 122          │
├────────────┼──────────────┤
│ 99         │ 136          │
├────────────┼──────────────┤
│ 99.9       │ 176          │
├────────────┼──────────────┤
│ 99.99      │ 193          │
├────────────┼──────────────┤
│ 99.999     │ 193          │
└────────────┴──────────────┘

1k requests in 2.2s, 148 kB read