Balanceamento de carga/benchmark/cluster-server/#2 REQ-500 02122023 1039.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 30 --workers 5 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
1 connections
5 workers

Running 30s test @ http://localhost:3000
500 connections
5 workers

-
┌─────────┬───────┬────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼───────┼────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 82 ms │ 982 ms │ 2209 ms │ 2360 ms │ 1069.42 ms │ 665.82 ms │ 4788 ms │
└─────────┴───────┴────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬───────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┼─────────┤
│ Req/Sec   │ 386     │ 386     │ 454     │ 541     │ 459.37  │ 34.97 │ 386     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┼─────────┤
│ Bytes/Sec │ 55.2 kB │ 55.2 kB │ 64.9 kB │ 77.4 kB │ 65.7 kB │ 5 kB  │ 55.2 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴───────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 13781 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 150

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 6            │
├────────────┼──────────────┤
│ 1          │ 26           │
├────────────┼──────────────┤
│ 2.5        │ 82           │
├────────────┼──────────────┤
│ 10         │ 266          │
├────────────┼──────────────┤
│ 25         │ 467          │
├────────────┼──────────────┤
│ 50         │ 982          │
├────────────┼──────────────┤
│ 75         │ 1664         │
├────────────┼──────────────┤
│ 90         │ 1962         │
├────────────┼──────────────┤
│ 97.5       │ 2209         │
├────────────┼──────────────┤
│ 99         │ 2360         │
├────────────┼──────────────┤
│ 99.9       │ 2617         │
├────────────┼──────────────┤
│ 99.99      │ 4580         │
├────────────┼──────────────┤
│ 99.999     │ 4788         │
└────────────┴──────────────┘

14k requests in 30.37s, 1.97 MB read