Balanceamento de carga/benchmark/cluster-server/#3 REQ-500 02122023 1041.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 30 --workers 6 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
1 connections
6 workers

Running 30s test @ http://localhost:3000
500 connections
6 workers

|
┌─────────┬───────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼───────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 54 ms │ 1036 ms │ 2880 ms │ 3070 ms │ 1103.36 ms │ 820.51 ms │ 3590 ms │
└─────────┴───────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 391     │ 391     │ 438     │ 486     │ 440.64 │ 25.03   │ 391     │
├───────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 55.9 kB │ 55.9 kB │ 62.7 kB │ 69.5 kB │ 63 kB  │ 3.57 kB │ 55.9 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 13219 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 180

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 6            │
├────────────┼──────────────┤
│ 1          │ 19           │
├────────────┼──────────────┤
│ 2.5        │ 54           │
├────────────┼──────────────┤
│ 10         │ 168          │
├────────────┼──────────────┤
│ 25         │ 385          │
├────────────┼──────────────┤
│ 50         │ 1036         │
├────────────┼──────────────┤
│ 75         │ 1575         │
├────────────┼──────────────┤
│ 90         │ 2508         │
├────────────┼──────────────┤
│ 97.5       │ 2880         │
├────────────┼──────────────┤
│ 99         │ 3070         │
├────────────┼──────────────┤
│ 99.9       │ 3558         │
├────────────┼──────────────┤
│ 99.99      │ 3583         │
├────────────┼──────────────┤
│ 99.999     │ 3590         │
└────────────┴──────────────┘

14k requests in 30.41s, 1.89 MB read