Balanceamento de carga/benchmark/cluster-server/#4 REQ-500 02122023 1047.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 30 --workers 8 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
1 connections
8 workers

Running 30s test @ http://localhost:3000
500 connections
8 workers

-
┌─────────┬───────┬─────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%     │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼─────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 43 ms │ 1025 ms │ 2577 ms │ 2722 ms │ 999.27 ms │ 727.19 ms │ 3209 ms │
└─────────┴───────┴─────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬───────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5% │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 412     │ 412     │ 484     │ 552   │ 487.37  │ 27.82   │ 412     │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 58.9 kB │ 58.9 kB │ 69.2 kB │ 79 kB │ 69.7 kB │ 3.98 kB │ 58.9 kB │
└───────────┴─────────┴─────────┴─────────┴───────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 14621 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 240

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 12           │
├────────────┼──────────────┤
│ 2.5        │ 43           │
├────────────┼──────────────┤
│ 10         │ 96           │
├────────────┼──────────────┤
│ 25         │ 329          │
├────────────┼──────────────┤
│ 50         │ 1025         │
├────────────┼──────────────┤
│ 75         │ 1328         │
├────────────┼──────────────┤
│ 90         │ 2145         │
├────────────┼──────────────┤
│ 97.5       │ 2577         │
├────────────┼──────────────┤
│ 99         │ 2722         │
├────────────┼──────────────┤
│ 99.9       │ 3145         │
├────────────┼──────────────┤
│ 99.99      │ 3207         │
├────────────┼──────────────┤
│ 99.999     │ 3209         │
└────────────┴──────────────┘

15k requests in 30.19s, 2.09 MB read